In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('data/employee.csv')

In [3]:
def my_sqrt(x):
    return x **2

In [4]:
def my_exp(x, n):
    return x ** n

In [5]:
my_sqrt(4), my_exp(3,5)

(16, 243)

In [6]:
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40]})

In [7]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [8]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [9]:
sq = df['a'].apply(my_sqrt)

In [10]:
sq

0    100
1    400
2    900
Name: a, dtype: int64

In [15]:
exp = df['a'].apply(my_exp,n=4)

In [16]:
exp

0     10000
1    160000
2    810000
Name: a, dtype: int64

In [17]:
df.apply(my_sqrt)

     a     b
0  100   400
1  400   900
2  900  1600

In [18]:
def avg_df(col):
    x = col[0]
    y = col[1]
    z = col[2]
    return (x + y + z)/3

In [19]:
df.apply(avg_df)

a    20.0
b    30.0
dtype: float64

In [20]:
df.shape

(3, 2)

In [21]:
def avg_df(col):
    sum = 0
    for item in col:
        sum += item
    return sum/df.shape[0]

In [22]:
df.apply(avg_df)

a    20.0
b    30.0
dtype: float64

In [23]:
def avg2_df(col):
    sum = 0
    for item in col:
        sum += item
    return sum/df.shape[1]

In [25]:
df.apply(avg2_df, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [26]:
import seaborn as sns

In [27]:
titanic = sns.load_dataset('titanic')

In [28]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [29]:
import numpy as np

In [30]:
def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

In [31]:
miss_col = titanic.apply(count_missing)

In [33]:
def prop_missing(vec):
    num = count_missing(vec)
    return num/vec.size

In [34]:
pmiss_col = titanic.apply(prop_missing)

In [37]:
def prop_complete(vec):
    return 1 - prop_missing(vec)

In [38]:
cmiss_col = titanic.apply(prop_complete)

In [39]:
cmiss_col

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [42]:
titanic['num_missing'] = titanic.apply(count_missing,axis=1)

In [43]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1

In [44]:
titanic.loc[titanic.num_missing > 1, :].head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,2
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,2
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,2
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,2
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2
29,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,2
32,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,2
36,1,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,yes,True,2
42,0,3,male,NaN,0,0,7.8958,C,Third,man,True,NaN,Cherbourg,no,True,2
45,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2